#### BuiltInFailures.MacroFailures Members

---

|  |
| --- |
| BuiltInFailures MacroFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures MacroFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | DuplicateModuleName | Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed. |

# See Also

BuiltInFailures MacroFailures Class

Autodesk.Revit.DB Namespace